УНФ_ТЕСТ/src/Documents/Взаимозачет/Взаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Взаимозачет</name>
  <basedOn>Document.СверкаВзаиморасчетов</basedOn>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетод</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПрочимиКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыОтложенные</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетодЭквайринг</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ЗакупкиДляКУДиР</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыНераспределенные</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВзаимозачет</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрочегоВзаимозачета</name>
    <type>
      <types>EnumRef.ВидыПрочегоВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентИсточник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчетов</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.РасходСоСчета</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходИзКассы</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СверкаВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоПодписант</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияПрочиеРасчеты</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дебитор</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПередачаВА</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ОтчетОПереработке</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплату</types>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Кредитор</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПередачаВА</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ОтчетКомиссионера</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.ОтчетОПереработке</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.ОтчетКомитенту</types>
        <types>DocumentRef.РасходИзКассы</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплату</types>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВидыОперацийВзаимозачет/ВидыОперацийВзаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВзаимозачет</name>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>ПереуступкаДолгаПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПереуступкаДолгаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДолгаПокупателя</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДолгаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПрочийВзаимозачет</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАвансовПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ЗачетАвансовПоставщику</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ВидыПрочегоВзаимозачета/ВидыПрочегоВзаимозачета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПрочегоВзаимозачета</name>
  <enumValues>
    <name>ДолгПокупателяИДолгПрочемуКонтрагенту</name>
  </enumValues>
  <enumValues>
    <name>ДолгПрочегоКонтрагентаИДолгПередПоставщиком</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/Взаимозачет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

// Процедура заполнения документа на основании сверки взаиморасчетов
//
Процедура ЗаполнитьПоСверкеВзаиморасчетов(ДокументСверкаВзаиморасчетов) Экспорт
	
	ДокументОснование 	= ДокументСверкаВзаиморасчетов;
	Организация			= ДокументСверкаВзаиморасчетов.Организация;
	Для каждого СтрокаДоговораКонтрагента Из ДокументСверкаВзаиморасчетов.ДоговорыКонтрагентов Цикл
		
		Если СтрокаДоговораКонтрагента.Отметка Тогда
			
			ДоговорКонтрагента = СтрокаДоговораКонтрагента.Договор;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		
		Если ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем 
			ИЛИ ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером Тогда
			
			ВидОперации			= Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя;
			КонтрагентИсточник	= ДокументСверкаВзаиморасчетов.Контрагент;
			
		ИначеЕсли ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоров.СПоставщиком 
			ИЛИ ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом Тогда
			
			ВидОперации			= Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику;
			Контрагент			= ДокументСверкаВзаиморасчетов.Контрагент;
			
		КонецЕсли;
		
		СальдоПоДаннымОрганизации	= ДокументСверкаВзаиморасчетов.ДанныеОрганизации.Итог("СуммаДолгКонтрагента") - ДокументСверкаВзаиморасчетов.ДанныеОрганизации.Итог("СуммаДолгОрганизации");
		СальдоПоДаннымКонтрагента	= ДокументСверкаВзаиморасчетов.ДанныеКонтрагента.Итог("СуммаДолгОрганизации") - ДокументСверкаВзаиморасчетов.ДанныеКонтрагента.Итог("СуммаДолгКонтрагента");
		Расхождение					= СальдоПоДаннымОрганизации - СальдоПоДаннымКонтрагента;
		
		Корреспонденция = ?(Расхождение < 0, ПланыСчетов.Управленческий.ПрочиеДоходы, ПланыСчетов.Управленческий.ПрочиеРасходы);
		
	КонецЕсли;
	
КонецПроцедуры //ЗаполнитьПоСверкеВзаиморасчетов()

// Процедура заполнения документа на основании поступления на счет
//
Процедура ЗаполнитьПоПоступлениюНаСчет(ДокументПоступлениеНаСчет, ИндексСтрокиРасшифровки) Экспорт
	
	// Основной сценарий: все документы оформлены в валюте и валюта расчетов по всем договорам - и с покупателем и с
	// агентом - рубли! Если будут оформлять документы в валюте, то курс и кратность для валют расчетов будут получены на
	//           дату текущего документа.
	// Курс и кратность валюты учета также получаем на дату документа (не зависит от того, в какой валюте ведутся расчеты).
	
	Дебитор.Очистить();
	Кредитор.Очистить();
	
	Дата = ДокументПоступлениеНаСчет.Дата;
	ДокументОснование 	= ДокументПоступлениеНаСчет;
	Организация			= ДокументПоступлениеНаСчет.Организация;
	ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПрочийВзаимозачет;
	ВидПрочегоВзаимозачета = Перечисления.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту;
	КорреспонденцияПрочиеРасчеты = ДокументПоступлениеНаСчет.Корреспонденция;
	
	// Заполним информацию о прочем контрагенте.
	Контрагент = ДокументПоступлениеНаСчет.Контрагент;
	НоваяСтрокаКредитор = Кредитор.Добавить();
	
	Если ДокументПоступлениеНаСчет.РасшифровкаПлатежа.Количество() > 0 Тогда
		НоваяСтрокаКредитор.Договор = ДокументПоступлениеНаСчет.РасшифровкаПлатежа[0].Договор;
	КонецЕсли;
	НоваяСтрокаКредитор.Документ = ДокументПоступлениеНаСчет;
	
	Если ИндексСтрокиРасшифровки >= ДокументПоступлениеНаСчет.РасшифровкаПлатежаОтАгента.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСДанными = ДокументПоступлениеНаСчет.РасшифровкаПлатежаОтАгента[ИндексСтрокиРасшифровки];
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
	ВалютаПоступленияНаСчет = ДокументПоступлениеНаСчет.ВалютаДенежныхСредств;
	ВалютаРасчетовКредитор = НоваяСтрокаКредитор.Договор.ВалютаРасчетов;
	
	КурсИКратностьВалютаРасчетовКредитор = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаРасчетовКредитор));
	НоваяСтрокаКредитор.Курс = КурсИКратностьВалютаРасчетовКредитор.Курс;
	НоваяСтрокаКредитор.Кратность = КурсИКратностьВалютаРасчетовКредитор.Кратность;
	
	// Заполним суммы для ТЧ Кредитор.
	Если ВалютаУчета = ВалютаПоступленияНаСчет Тогда
		НоваяСтрокаКредитор.СуммаУчета = СтрокаСДанными.ПолученоОтКлиента;
	Иначе
		// Курс и кратность валюты учета всегда получаем на дату документа.
		КурсИКратностьВалютаУчета = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаУчета));
		КурсИКратностьВалютаПоступленияНаСчет = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаПоступленияНаСчет));
		НоваяСтрокаКредитор.СуммаУчета = СтрокаСДанными.ПолученоОтКлиента * КурсИКратностьВалютаПоступленияНаСчет.Курс * КурсИКратностьВалютаУчета.Кратность
			/ ?(КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаУчета.Курс = 0,
				1,
				КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаУчета.Курс);
	КонецЕсли;
	
	Если ВалютаРасчетовКредитор = ВалютаПоступленияНаСчет Тогда
		НоваяСтрокаКредитор.СуммаРасчетов = СтрокаСДанными.ПолученоОтКлиента;
	Иначе
		КурсИКратностьВалютаПоступленияНаСчет = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаПоступленияНаСчет));
		НоваяСтрокаКредитор.СуммаРасчетов = СтрокаСДанными.ПолученоОтКлиента * КурсИКратностьВалютаПоступленияНаСчет.Курс * КурсИКратностьВалютаРасчетовКредитор.Кратность
			/ ?(КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаРасчетовКредитор.Курс = 0,
				1,
				КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаРасчетовКредитор.Курс);
	КонецЕсли;
	
	// Заполним информацию о покупателе.
	КонтрагентИсточник = СтрокаСДанными.Документ.Контрагент;
	
	НоваяСтрокаДебитор = Дебитор.Добавить();
	НоваяСтрокаДебитор.Договор = СтрокаСДанными.Документ.Договор;
	НоваяСтрокаДебитор.Документ = СтрокаСДанными.Документ;
	НоваяСтрокаДебитор.Заказ = СтрокаСДанными.Заказ;
	НоваяСтрокаДебитор.СчетНаОплату = СтрокаСДанными.СчетНаОплату;
	
	ВалютаРасчетов = НоваяСтрокаДебитор.Договор.ВалютаРасчетов;
	
	КурсИКратностьВалютаРасчетов = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаРасчетов));
	НоваяСтрокаДебитор.Курс = КурсИКратностьВалютаРасчетов.Курс;
	НоваяСтрокаДебитор.Кратность = КурсИКратностьВалютаРасчетов.Кратность;
	
	// Заполним суммы для ТЧ Дебитор.
	НоваяСтрокаДебитор.СуммаУчета = НоваяСтрокаКредитор.СуммаУчета;
	
	Если ВалютаРасчетов = ВалютаПоступленияНаСчет Тогда
		НоваяСтрокаДебитор.СуммаРасчетов = СтрокаСДанными.ПолученоОтКлиента;
	Иначе
		КурсИКратностьВалютаПоступленияНаСчет = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", ВалютаПоступленияНаСчет));
		НоваяСтрокаДебитор.СуммаРасчетов = СтрокаСДанными.ПолученоОтКлиента * КурсИКратностьВалютаПоступленияНаСчет.Курс * КурсИКратностьВалютаРасчетов.Кратность
			/ ?(КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаРасчетов.Курс = 0, 1, КурсИКратностьВалютаПоступленияНаСчет.Кратность * КурсИКратностьВалютаРасчетов.Курс);
	КонецЕсли;
	
КонецПроцедуры //ЗаполнитьПоСверкеВзаиморасчетов()

Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("Ссылка") Тогда
		Если ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
			
			ЗаполнитьПоПоступлениюНаСчет(ДанныеЗаполнения.Ссылка, ДанныеЗаполнения.ИндексСтрокиРасшифровки);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументРасчетов) Тогда
		ДокументРасчетов = Неопределено;
	КонецЕсли;
	
	Для каждого ТекСтрока Из Дебитор Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Документ) Тогда
			ТекСтрока.Документ = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекСтрока Из Кредитор Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Документ) Тогда
			ТекСтрока.Документ = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя Тогда
			Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику Тогда
			Заказ = Документы.ЗаказПоставщику.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.Взаимозачет
		ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПокупателя
		ИЛИ (ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПрочийВзаимозачет
			И ВидПрочегоВзаимозачета = Перечисления.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту) Тогда
		СуммаРасчетов = 0;
		СуммаУчета = 0;
		Для каждого ТекСтрока Из Дебитор Цикл
			СуммаРасчетов = СуммаРасчетов + ТекСтрока.СуммаРасчетов;
		КонецЦикла;
		Для каждого ТекСтрока Из Дебитор Цикл
			СуммаУчета = СуммаУчета + ТекСтрока.СуммаУчета;
		КонецЦикла;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику
		ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПоставщику
		ИЛИ (ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПрочийВзаимозачет
			И ВидПрочегоВзаимозачета = Перечисления.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком) Тогда
		СуммаРасчетов = 0;
		СуммаУчета = 0;
		Для каждого ТекСтрока Из Кредитор Цикл
			СуммаРасчетов = СуммаРасчетов + ТекСтрока.СуммаРасчетов;
		КонецЦикла;
		Для каждого ТекСтрока Из Кредитор Цикл
			СуммаУчета = СуммаУчета + ТекСтрока.СуммаУчета;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.Взаимозачет
		ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПоставщику Тогда
		
		ДебиторСуммаУчета = Дебитор.Итог("СуммаУчета");
		КредиторСуммаУчета = Кредитор.Итог("СуммаУчета");
		
		Если ДебиторСуммаУчета <> КредиторСуммаУчета Тогда
			Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПокупателя
				ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПоставщику Тогда
				ТекстСообщения = НСтр("ru = 'Сумма учета табличной части ""Авансы"", не равна сумме учета по табличной части ""Долги""!'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Сумма учета табличной части ""Расчеты с покупателем"", не равна сумме учета по табличной части ""Расчеты с поставщиком""!'");
			КонецЕсли;
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Дебитор",
				1,
				"СуммаУчета",
				Отказ
			);
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаРасчетов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Курс");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кратность");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаУчета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Договор");
			Для каждого СтрокаТЧ Из Дебитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентИсточник);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Документ");
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Договор");
			Для каждого СтрокаТЧ Из Кредитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Документ");
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПрочегоВзаимозачета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КорреспонденцияПрочиеРасчеты");
		
		Если ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПокупателя
			ИЛИ ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ЗачетАвансовПоставщику Тогда
			
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
			
			Для Каждого ТекущаяСтрока Из Дебитор Цикл
				Если НЕ ТекущаяСтрока.ПризнакАванса Тогда
					ТекстСообщения = НСтр("ru = 'В табличной части ""Авансы"" можно указать только строки с установленным флагом ""Аванс""!'");
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Дебитор",
						ТекущаяСтрока.НомерСтроки,
						"ПризнакАванса",
						Отказ
					);
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТекущаяСтрока Из Кредитор Цикл
				Если ТекущаяСтрока.ПризнакАванса Тогда
					ТекстСообщения = НСтр("ru = 'В табличной части ""Долги"" можно указать только строки со сброшенным флагом ""Аванс""!'");
					УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
						ЭтотОбъект,
						ТекстСообщения,
						"Дебитор",
						ТекущаяСтрока.НомерСтроки,
						"ПризнакАванса",
						Отказ
					);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПереуступкаДолгаПокупателя Тогда
		
		ДебиторСуммаУчета = Дебитор.Итог("СуммаУчета");
		ТекстСообщения = НСтр("ru = 'Сумма учета, не равна сумме учета табличной части ""Расчеты с покупателем""!'");
		
		Если ДебиторСуммаУчета <> СуммаУчета Тогда
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				Неопределено,
				1,
				"СуммаУчета",
				Отказ
			);
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Договор");
			Для каждого СтрокаТЧ Из Дебитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентИсточник);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Документ");
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
			Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Документ");
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПрочегоВзаимозачета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КорреспонденцияПрочиеРасчеты");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПереуступкаДолгаПоставщику Тогда
		
		КредиторСуммаУчета = Кредитор.Итог("СуммаУчета");
		
		Если КредиторСуммаУчета <> СуммаУчета Тогда
			ТекстСообщения = НСтр("ru = 'Сумма учета, не равна сумме учета табличной части ""Расчеты с поставщиком""!'");
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				Неопределено,
				1,
				"СуммаУчета",
				Отказ
			);
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Договор");
			Для каждого СтрокаТЧ Из Кредитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентИсточник);
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Документ");
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
			Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Документ");
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПрочегоВзаимозачета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КорреспонденцияПрочиеРасчеты");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПокупателя Тогда
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаРасчетов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Курс");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кратность");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаУчета");
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Договор");
			Для каждого СтрокаТЧ Из Дебитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентИсточник);
			КонецЦикла;
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Документ");
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПрочегоВзаимозачета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КорреспонденцияПрочиеРасчеты");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.КорректировкаДолгаПоставщику Тогда
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КонтрагентИсточник");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаРасчетов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Курс");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кратность");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаУчета");
		
		Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Договор");
			Для каждого СтрокаТЧ Из Кредитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
			КонецЦикла;
		КонецЕсли;
			
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Документ");
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ВидПрочегоВзаимозачета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "КорреспонденцияПрочиеРасчеты");
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийВзаимозачет.ПрочийВзаимозачет Тогда
		
		ДебиторСуммаУчета = Дебитор.Итог("СуммаУчета");
		КредиторСуммаУчета = Кредитор.Итог("СуммаУчета");
		
		Если ДебиторСуммаУчета <> КредиторСуммаУчета Тогда
			Если ВидПрочегоВзаимозачета = Перечисления.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту Тогда
				ТекстСообщения = НСтр("ru = 'Сумма учета табличной части ""Расчеты с покупателем"", не равна сумме учета по табличной части ""Расчеты с прочим контрагентом""!'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Сумма учета табличной части ""Расчеты с прочим контрагентом"", не равна сумме учета по табличной части ""Расчеты с поставщиком""!'");
			КонецЕсли;
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Дебитор",
				1,
				"СуммаУчета",
				Отказ
			);
		КонецЕсли;
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Договор");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаРасчетов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Курс");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кратность");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СуммаУчета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Корреспонденция");
		
		Если НЕ КонтрагентИсточник.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Договор");
			Для каждого СтрокаТЧ Из Дебитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентИсточник);
			КонецЦикла;
		КонецЕсли;
		
		Если ВидПрочегоВзаимозачета <> Перечисления.ВидыПрочегоВзаимозачета.ДолгПокупателяИДолгПрочемуКонтрагенту
			ИЛИ НЕ КонтрагентИсточник.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Дебитор.Документ");
		КонецЕсли;
		
		Если НЕ Контрагент.ВестиРасчетыПоДоговорам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Договор");
			Для каждого СтрокаТЧ Из Кредитор Цикл
				СтрокаТЧ.Договор = Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
			КонецЦикла;
		КонецЕсли;
		
		Если ВидПрочегоВзаимозачета <> Перечисления.ВидыПрочегоВзаимозачета.ДолгПрочегоКонтрагентаИДолгПередПоставщиком
			ИЛИ НЕ Контрагент.ВестиРасчетыПоДокументам Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Кредитор.Документ");
		КонецЕсли;
		
	КонецЕсли
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.Взаимозачет.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПоставщиками(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПрочимиКонтрагентами(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыОтложенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыНераспределенные(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ДоходыИРасходыКассовыйМетодЭквайринг");
	УправлениеНебольшойФирмойСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ОплатаДокументов");
	УправлениеНебольшойФирмойСервер.ОтразитьЗакупкиДляКУДиР(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.Взаимозачет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.Взаимозачет.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Процедура - обработчик события ОбработкаЗаполнения объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.СверкаВзаиморасчетов")] = "ЗаполнитьПоСверкеВзаиморасчетов";
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
